#### TextBaselineStyle Enumeration

---

|  |
| --- |
| See Also |

Supported styles of text position relative to the normal baseline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum TextBaselineStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TextBaselineStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class TextBaselineStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Normal | Indicates a normal text with letters positioned on the baseline. |
| Subscript | Indicates a subsript text. |
| Superscript | Indicates a superscript text. |

# See Also

Autodesk.Revit.DB Namespace